Q1 
(a)
센서(sensor): 외부 환경의 정보를 수집하는 장치
actuator: 센서 데이터를 바탕으로 실제 동작을 수행하는 장치

(b)
하드웨어 성능차이와 역할차이 때문에(대시보드는 사용자 인터페이스 중심)

(c)
브로커(MQTT등)의 이점: 디바이스 간 직접 연결 불필요, 데이터 전달을 중앙에서 관리, 확장성 증가 (디바이스 추가 쉬움), 통신 구조 단순화

Q2
(a)
성능분산, 장애 발생 시 영향 최소화, 유지보수 용이, 확장성 증가

(b)
rasberry pi/ 소형 서버, Linux기반 OS
최소 요구: RAM 1Gb이상, CPU ARM 또는 x86

(c)
Arduino: 단순, 입문용, 성능 낮음, 네트워크 기능 부족
Rasberry Pi: 소형 컴퓨터, OS사용 가능, 전력 소모 높음
ESP32: WIFI, Bluetooth 내장, IOT최적화, 저전력

스마트홈 구축 아이디어
사용할 센서: 온도, 습도, 조도, PIR모션, 가스, 문열림 센서
대시보드 구성: 실시간 온도/습도 표시, 전등상태 ON/OFF, 보안 상태 표시, 
시스템 시나리오: 
사람이 집에 들어옴->모션센서 감지, 조명 ON
밤 11시 이후->모든 조명 자동 OFF, 보안 모드 활성화
온도 28도 이상->에어컨 자동 작동
